Documents/Requests/Soap_GetNonStandardRates- API_04_05_2022_02_56_09_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/rates/VFDEGetNonStandardRate" xmlns:vfd1="http://amdocs/vfde/rates/VFDENonStandardRatesInput">
  <soapenv:Header />
  <soapenv:Body>
    <vfd:GetNonStandardRatesRequest>
      <vfd1:ROOT>
        <Event>
          <Type>GetProductAvailability</Type>
          <ID>saurav1234</ID>
        </Event>
        <DATA>
          <AddressId>1591979</AddressId>
          <Filters>
            <ContractCode>VVO</ContractCode>
            <ProductCodes>VOL, 4KE</ProductCodes>
          </Filters>
          <Filters>
            <ContractCode>VDE</ContractCode>
            <ProductCodes>VOL, 4KE</ProductCodes>
          </Filters>
          <Filters>
            <ContractCode>VVE</ContractCode>
            <ProductCodes>VOL, 4KE</ProductCodes>
          </Filters>
          <Filters>
            <ContractCode>VDP</ContractCode>
            <ProductCodes>VOL, 4KE</ProductCodes>
          </Filters>
          <Filters>
            <ContractCode>VHP</ContractCode>
            <ProductCodes>VOL, 4KE</ProductCodes>
          </Filters>
          <Filters>
            <ContractCode>VHE</ContractCode>
            <ProductCodes>VOL, 4KE</ProductCodes>
          </Filters>
        </DATA>
      </vfd1:ROOT>
    </vfd:GetNonStandardRatesRequest>
  </soapenv:Body>
</soapenv:Envelope>